package ru.crawler.enums;

import java.util.List;

public enum Words {
    x1("в"),
    x2("на"),
    x3("под"),
    x4("за"),
    x5("перед"),
    x6("между"),
    x7("над"),
    x8("по"),
    x9("с"),
    x10("у"),
    x11("от"),
    x12("к"),
    x13("о"),
    x14("рядом с"),
    x15("вблизи"),
    x16("внутри"),
    x17("снаружи"),
    x18("вокруг"),
    x19("вдоль"),
    x20("сквозь"),
    x21("к"),
    x22("ко"),
    x23("кроме"),
    x24("между"),
    x25("меж"),
    x26("на"),
    x27("над"),
    x28("о"),
    x29("об"),
    x30("обо"),
    x31("от"),
    x32("ото"),
    x33("перед"),
    x34("передо"),
    x35("пред"),
    x36("пo"),
    x37("под"),
    x38("подо"),
    x39("при"),
    x40("про"),
    x41("ради"),
    x42("с"),
    x43("со"),
    x44("сквозь"),
    x45("среди"),
    x46("у"),
    x47("через"),
    x48("чрез");

    private final String value;

    Words(String value) {
        this.value = value;
    }


    public String getValue() {
        return value;
    }
}
